,
    {
      "title": "Like a Virgin (1984) - June 30, 1944",
      "music_url": "https://www.youtube.com/watch?v=s__rX_WL100&ab_channel=Madonna",
      "war_url": "https://www.youtube.com/watch?v=6-XJlJCdsms&ab_channel=PeriscopeFilm",
      "war_title": "The Battle of Saipan: Hell on Earth in the Pacific",
      "commentary": "Saipan became a slaughterhouse as American and Japanese forces clashed in one of the most horrifying battles of World War II. Blood soaked the beaches, civilians were driven to mass suicides, and the relentless onslaught of flamethrowers, artillery, and aerial bombardments turned the island into a nightmarish wasteland. Thousands were incinerated, mutilated, or left to rot under the merciless sun. There was no mercy, only death."
    },
    {
      "title": "Material Girl (1985) - December 15, 1944",
      "music_url": "https://www.youtube.com/watch?v=6p-lDYPR2P8&ab_channel=Madonna",
      "war_url": "https://www.youtube.com/watch?v=8a8fqGpHgsk&ab_channel=HISTORY",
      "war_title": "The Battle of the Bulge: Hitler's Last Blood-Soaked Gamble",
      "commentary": "The forests of the Ardennes became a frozen graveyard as Hitler unleashed his final, desperate assault on the Western Front. Thousands of soldiers were swallowed by the snow, their bodies torn apart by relentless artillery and machine-gun fire. Towns were reduced to rubble, civilians slaughtered, and the world held its breath as the Nazis clawed for one last, monstrous victory. The war's brutality reached new, unfathomable depths."
    },
    {
      "title": "Crazy for You (1985) - March 1, 1945",
      "music_url": "https://www.youtube.com/watch?v=DHutZXREZ0E&ab_channel=Madonna",
      "war_url": "https://www.youtube.com/watch?v=etgVz4l4bu4&ab_channel=CoffeeorDie",
      "war_title": "The Battle of Remagen: The Bridge That Bled",
      "commentary": "As World War II neared its devastating conclusion, the Allies fought savagely to seize the Ludendorff Bridge. Bodies filled the Rhine, blown apart by desperate German resistance. Bullets rained like a storm of death, the bridge teetered on collapse, and the march toward Berlin became a bloody struggle of attrition. The bridge stood, but only after countless lives were sacrificed upon the altar of war."
    },
    {
      "title": "Into the Groove (1985) - November 26, 1945",
      "music_url": "https://www.youtube.com/watch?v=52iW3lcpK5M&ab_channel=Madonna",
      "war_url": "https://www.youtube.com/watch?v=SHN4WbNBHjs&ab_channel=BritishPath%C3%A9",
      "war_title": "The Nuremberg Trials: Humanity Confronts Its Darkest Hour",
      "commentary": "The horrors of the Nazi regime came to light as war criminals stood trial for crimes so unspeakable that they defied comprehension. Auschwitz, Buchenwald, and the charred ruins of Europe bore witness to the ultimate failure of civilization. Millions lay dead, justice was a fleeting illusion, and as the nooses tightened around the necks of the condemned, the world could only shudder at the depths of human depravity."
    },
    {
      "title": "Papa Don't Preach (1986) - September 19, 1947",
      "music_url": "https://www.youtube.com/watch?v=G333Is7VPOg&ab_channel=Madonna",
      "war_url": null,
      "war_title": "The National Security Act: The Birth of the American Surveillance Empire",
      "commentary": "In the grim aftermath of World War II, the United States government restructured itself into a war machine of paranoia and control. The CIA was born, intelligence agencies grew bloated with unchecked power, and the seeds of Cold War espionage were planted. A new era of deception, secret wars, and shadowy assassinations began, dragging the world into an unrelenting spiral of conflict and fear."
    },
    {
      "title": "Open Your Heart (1986) - August 6, 1948",
      "music_url": "https://www.youtube.com/watch?v=XenglJwDl7g&ab_channel=Madonna-Topic",
      "war_url": "https://www.youtube.com/watch?v=h1tf8lv_yak&rco=1&ab_channel=CGTN",
      "war_title": "The Third Anniversary of Hiroshima: A Legacy of Death",
      "commentary": "Three years after the nuclear inferno obliterated Hiroshima, the world stood in horrified silence, knowing that mankind had forged its own annihilation. The shadows of vaporized bodies still lingered on scorched walls, radiation rotted flesh from the inside out, and the nightmare of nuclear warfare loomed like a death sentence over humanity. The arms race had begun, and with it, the countdown to Armageddon."
    },
    {
      "title": "Live to Tell (1986) - April 18, 1947",
      "music_url": "https://www.youtube.com/watch?v=IzAO9A9GjgI&ab_channel=Madonna",
      "war_url": "https://www.youtube.com/watch?v=YkLFGWTKPY4&ab_channel=AlJazeeraEnglish",
      "war_title": "The Partition of India: A Nation Carved in Blood",
      "commentary": "As Britain's grip on India crumbled, chaos erupted in the streets. Hindus, Muslims, and Sikhs turned on one another in an orgy of violence, hacking their neighbors to pieces, burning villages to the ground, and leaving bodies stacked like cordwood. Mass rapes, executions, and forced migrations turned the subcontinent into a hellscape of suffering. The birth of two nations came at the cost of millions of shattered lives."
    },
    {
      "title": "La Isla Bonita (1987) - February 18, 1949",
      "music_url": "https://www.youtube.com/watch?v=zpzdgmqIHOQ&ab_channel=Madonna",
      "war_url": "https://www.youtube.com/watch?v=0O_ZRYHYVcU&ab_channel=AsianHistorian",
      "war_title": "The Indonesian National Revolution: A Colonial Bloodbath",
      "commentary": "The streets of Indonesia ran red as nationalist forces fought tooth and nail against Dutch colonial rule. Villages were razed, executions were swift and merciless, and as the Netherlands clung desperately to its crumbling empire, thousands were left to rot in mass graves. Indonesia would be free, but not before the world witnessed yet another horrifying chapter of colonial brutality."
    },
    {
      "title": "Like a Prayer (1989) - March 3, 1953",
      "music_url": "https://www.youtube.com/watch?v=79fzeNUqQbQ&ab_channel=Madonna",
      "war_url": "https://www.youtube.com/watch?v=ohwMtPJ-ExI&ab_channel=AJ%2B",
      "war_title": "Stalin's Final Stroke: The Death of a Tyrant",
      "commentary": "As Joseph Stalin lay in a pool of his own urine, his monstrous reign of terror finally came to a wretched end. Millions had been slaughtered under his rule, entire nations lived in fear, and now, in his final moments, his paranoia-riddled mind could no longer control the inevitable. But his death did not end the nightmare—it only left a power vacuum for even more chaos to follow."
    },
    {
      "title": "Express Yourself (1989) - July 15, 1953",
      "music_url": "https://www.youtube.com/watch?v=GsVcUzP_O_8&ab_channel=Madonna",
      "war_url": "https://youtu.be/Kf8qYAIP91s",
      "war_title": "The Korean War: A Stalemate Drenched in Blood",
      "commentary": "The Korean Peninsula was left a shattered, lifeless wasteland as the war ground to a miserable halt. Entire cities had been erased, millions lay dead or missing, and the demilitarized zone became an eerie scar that would forever divide a nation. The war may have ended, but the hatred, division, and violence would never be undone."
    },
    {
      "title": "Vogue (1990) - 1954",
      "music_url": "https://www.youtube.com/watch?v=GuJQSAiODqI&ab_channel=Madonna",
      "war_url": "https://www.youtube.com/watch?v=lS2DPx-4sbI&ab_channel=BritishPath%C3%A9",
      "war_title": "The First Taiwan Strait Crisis",
      "commentary": "The First Taiwan Strait Crisis was a brutal display of Cold War aggression, plunging the region into chaos. In 1954, the People's Republic of China unleashed relentless artillery barrages on the Kinmen and Matsu islands, pounding civilian and military targets alike in an unprovoked attempt to strangle Taiwan into submission. The skies were thick with smoke, the ground littered with shattered bodies, and every moment brought the looming specter of full-scale war. As the United States scrambled to react, nuclear catastrophe hung in the air, with superpowers teetering on the edge of annihilation. The world watched in terror as the crisis spiraled, proving once again that no nation was safe from the unchecked, bloodthirsty ambitions of Cold War titans."
    }